app/Controllers/Main.php

    public function admin()
    {
        if (array_key_exists('user_session', session()->get())) {
            $qturl_m = new \App\Models\CuteUrl();
            $user = session()->get('user_session');

            $data['user'] = $user;
            $data['urls'] = $qturl_m
                ->where('user_id', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `cute_url`
WHERE `user_id` = '3'
ORDER BY `dtc` DESC

    public function users()
    {
        if (array_key_exists('user_session', session()->get())) {

            $user_m = new \App\Models\UserAccount();

            $user = session()->get('user_session');

            if (array_key_exists('user_id', $this->request->getGet())) {

                $data['edit_user'] = $user_m->find($this->request->getGet('user_id'));
            }

            $data['user'] = $user;
            $data['users'] = $user_m
                ->where('id !=', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'
SELECT *
FROM `users`
WHERE `id` != '9'
ORDER BY `dtc` DESC

                    $short_name = $this->request->getPost('short_name');

                    if ($password === $password2) {
                        $user_m->save([
                            'username' => $username,
                            'passw' => password_hash($password, PASSWORD_ARGON2ID),
                            'short_name' => $short_name,
                        ]);
---
INSERT INTO `users` (`username`, `passw`, `short_name`) VALUES ('alex', '$argon2id$v=19$m=65536,t=4,p=1$eTl4RTFhRHlENENyclJHQg$kophpNYzj/8srmEcdcdrXUWHavdtRl6vscBxTc4U08U', 'Alexandrine')

                        $edit['passw'] = password_hash($password, PASSWORD_ARGON2ID);
                    }

                    $user_m->save($edit);
---
UPDATE `users` SET `id` = '6', `short_name` = 'Patty', `username` = 'pattzy'
WHERE `users`.`id` IN ('6')

                    $user_m = new \App\Models\UserAccount();
                    $user_id = $this->request->getGet('user_id');

                    $user_m->delete($user_id);
---
DELETE FROM `users`
WHERE `id` IN ('6')

                    $random_code = strtolower(random_string('alnum',32));
                    $short_code = strtolower(random_string('alnum',8));

                    $qturl_m->save([
                        'source_url' => $source_url,
                        'target_code' => $random_code,
                        'custom' => $short_code,
                        'user_id' => $user['id'],
                    ]);
---
INSERT INTO `cute_url` (`source_url`, `target_code`, `custom`, `user_id`) VALUES ('https://www.youtube.com/results?search_query=responsive+login+form+html+css', 'r9bfnimxwfejk3vy0ju72dpsdhvgothr', 'x5hljnzc', '3')